Artifacts/code incubator/CaseFolder/With_pisoFoam/Reference/NS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;



boundaryField
{
    topBoundary
    {
        type            symmetry;
    }

    downStream
    {
        type            zeroGradient;
    }

    upStream
    {
        type            fixedValue;
	value		uniform 1000;
    }

    subBoundary
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }

    bottomSymmetry 
    { 
        type            symmetryPlane; 
    } 
}
// ************************************************************************* //
